In [1]:
import pandas as pd
import seaborn as sns
df = pd.read_csv('adm_data.csv')

In [2]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [3]:
df.isnull().values.any()

False

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         400 non-null    int64
 1   GRE Score          400 non-null    int64
 2   TOEFL Score        400 non-null    int64
 3   University Rating  400 non-null    int64
 4   SOP                400 non-null    float64
 5   LOR                400 non-null    float64
 6   CGPA               400 non-null    float64
 7   Research           400 non-null    int64
 8   Chance of Admit    400 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 28.2 KB

In [5]:
df = df.drop(columns = ['Serial No.', 'GRE Score', 'TOEFL Score', 'SOP', 'Research'])

In [6]:
df.head()

   University Rating  LOR   CGPA  Chance of Admit
0                  4   4.5  9.65              0.92
1                  4   4.5  8.87              0.76
2                  3   3.5  8.00              0.72
3                  3   2.5  8.67              0.80
4                  2   3.0  8.21              0.65

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   University Rating  400 non-null    int64
 1   LOR                400 non-null    float64
 2   CGPA               400 non-null    float64
 3   Chance of Admit    400 non-null    float64
dtypes: float64(3), int64(1)
memory usage: 12.6 KB

In [8]:
df.corr(method='pearson', min_periods=1)

                   University Rating      LOR       CGPA  Chance of Admit
University Rating           1.000000  0.660123  0.746479          0.711250
LOR                         0.660123  1.000000  0.670211          0.669889
CGPA                        0.746479  0.670211  1.000000          0.873289
Chance of Admit             0.711250  0.669889  0.873289          1.000000